Revit 2026 API

# DocumentDifference Class

---

DocumentDifference represents the difference (including added elements, modified elements and deleted elements) of a Revit model between different DocumentVersion of the model.

SystemObject Autodesk.Revit.DBDocumentDifference

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DocumentDifference : IDisposable
```
```vb
Public Class DocumentDifference
	Implements IDisposable
```
```cpp
public ref class DocumentDifference : IDisposable
```
```fsharp
type DocumentDifference =
    class
        interface IDisposable
    end
```

The DocumentDifference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreDeletedElementIdsAvailable | Whether or the deleted elements were retrieved. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DocumentDifference |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCreatedElementIds | Created element id collection. |
|  | GetDeletedElementIds | Deleted element id collection. For non-worksharing models, this will always be an empty collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetModifiedElementIds | Modified element id collection. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

For workshared models, DocumentDifference may contain all the added elements, modified elements and deleted elements. For non-workshared models, deleted elements are not tracked, so this object may only contain added elements and modified elements.

#### Reference

Autodesk.Revit.DB Namespace